SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_gpcrc.h
/* Bit fields for GPCRC CTRL */
#define _GPCRC_CTRL_RESETVALUE                  0x00000000UL                            /**< Default value for GPCRC_CTRL                */
#define _GPCRC_CTRL_MASK                        0x00002710UL                            /**< Mask for GPCRC_CTRL                         */
#define GPCRC_CTRL_POLYSEL                      (0x1UL << 4)                            /**< Polynomial Select                           */
#define _GPCRC_CTRL_POLYSEL_SHIFT               4                                       /**< Shift value for GPCRC_POLYSEL               */
#define _GPCRC_CTRL_POLYSEL_MASK                0x10UL                                  /**< Bit mask for GPCRC_POLYSEL                  */
#define _GPCRC_CTRL_POLYSEL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define _GPCRC_CTRL_POLYSEL_CRC32               0x00000000UL                            /**< Mode CRC32 for GPCRC_CTRL                   */
#define _GPCRC_CTRL_POLYSEL_CRC16               0x00000001UL                            /**< Mode CRC16 for GPCRC_CTRL                   */
#define GPCRC_CTRL_POLYSEL_DEFAULT              (_GPCRC_CTRL_POLYSEL_DEFAULT << 4)      /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_POLYSEL_CRC32                (_GPCRC_CTRL_POLYSEL_CRC32 << 4)        /**< Shifted mode CRC32 for GPCRC_CTRL           */
#define GPCRC_CTRL_POLYSEL_CRC16                (_GPCRC_CTRL_POLYSEL_CRC16 << 4)        /**< Shifted mode CRC16 for GPCRC_CTRL           */
#define GPCRC_CTRL_BYTEMODE                     (0x1UL << 8)                            /**< Byte Mode Enable                            */
#define _GPCRC_CTRL_BYTEMODE_SHIFT              8                                       /**< Shift value for GPCRC_BYTEMODE              */
#define _GPCRC_CTRL_BYTEMODE_MASK               0x100UL                                 /**< Bit mask for GPCRC_BYTEMODE                 */
#define _GPCRC_CTRL_BYTEMODE_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define GPCRC_CTRL_BYTEMODE_DEFAULT             (_GPCRC_CTRL_BYTEMODE_DEFAULT << 8)     /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_BITREVERSE                   (0x1UL << 9)                            /**< Byte-level Bit Reverse Enable               */
#define _GPCRC_CTRL_BITREVERSE_SHIFT            9                                       /**< Shift value for GPCRC_BITREVERSE            */
#define _GPCRC_CTRL_BITREVERSE_MASK             0x200UL                                 /**< Bit mask for GPCRC_BITREVERSE               */
#define _GPCRC_CTRL_BITREVERSE_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define _GPCRC_CTRL_BITREVERSE_NORMAL           0x00000000UL                            /**< Mode NORMAL for GPCRC_CTRL                  */
#define _GPCRC_CTRL_BITREVERSE_REVERSED         0x00000001UL                            /**< Mode REVERSED for GPCRC_CTRL                */
#define GPCRC_CTRL_BITREVERSE_DEFAULT           (_GPCRC_CTRL_BITREVERSE_DEFAULT << 9)   /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_BITREVERSE_NORMAL            (_GPCRC_CTRL_BITREVERSE_NORMAL << 9)    /**< Shifted mode NORMAL for GPCRC_CTRL          */
#define GPCRC_CTRL_BITREVERSE_REVERSED          (_GPCRC_CTRL_BITREVERSE_REVERSED << 9)  /**< Shifted mode REVERSED for GPCRC_CTRL        */
#define GPCRC_CTRL_BYTEREVERSE                  (0x1UL << 10)                           /**< Byte Reverse Mode                           */
#define _GPCRC_CTRL_BYTEREVERSE_SHIFT           10                                      /**< Shift value for GPCRC_BYTEREVERSE           */
#define _GPCRC_CTRL_BYTEREVERSE_MASK            0x400UL                                 /**< Bit mask for GPCRC_BYTEREVERSE              */
#define _GPCRC_CTRL_BYTEREVERSE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define _GPCRC_CTRL_BYTEREVERSE_NORMAL          0x00000000UL                            /**< Mode NORMAL for GPCRC_CTRL                  */
#define _GPCRC_CTRL_BYTEREVERSE_REVERSED        0x00000001UL                            /**< Mode REVERSED for GPCRC_CTRL                */
#define GPCRC_CTRL_BYTEREVERSE_DEFAULT          (_GPCRC_CTRL_BYTEREVERSE_DEFAULT << 10) /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_BYTEREVERSE_NORMAL           (_GPCRC_CTRL_BYTEREVERSE_NORMAL << 10)  /**< Shifted mode NORMAL for GPCRC_CTRL          */
#define GPCRC_CTRL_BYTEREVERSE_REVERSED         (_GPCRC_CTRL_BYTEREVERSE_REVERSED << 10) /**< Shifted mode REVERSED for GPCRC_CTRL        */
#define GPCRC_CTRL_AUTOINIT                     (0x1UL << 13)                           /**< Auto Init Enable                            */
#define _GPCRC_CTRL_AUTOINIT_SHIFT              13                                      /**< Shift value for GPCRC_AUTOINIT              */
#define _GPCRC_CTRL_AUTOINIT_MASK               0x2000UL                                /**< Bit mask for GPCRC_AUTOINIT                 */
#define _GPCRC_CTRL_AUTOINIT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define GPCRC_CTRL_AUTOINIT_DEFAULT             (_GPCRC_CTRL_AUTOINIT_DEFAULT << 13)    /**< Shifted mode DEFAULT for GPCRC_CTRL         */

/* Bit fields for GPCRC CMD */
#define _GPCRC_CMD_RESETVALUE                   0x00000000UL                            /**< Default value for GPCRC_CMD                 */
#define _GPCRC_CMD_MASK                         0x80000001UL                            /**< Mask for GPCRC_CMD                          */
#define GPCRC_CMD_INIT                          (0x1UL << 0)                            /**< Initialization Enable                       */
#define _GPCRC_CMD_INIT_SHIFT                   0                                       /**< Shift value for GPCRC_INIT                  */
#define _GPCRC_CMD_INIT_MASK                    0x1UL                                   /**< Bit mask for GPCRC_INIT                     */
#define _GPCRC_CMD_INIT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for GPCRC_CMD                  */
#define GPCRC_CMD_INIT_DEFAULT                  (_GPCRC_CMD_INIT_DEFAULT << 0)          /**< Shifted mode DEFAULT for GPCRC_CMD          */

